Documents/РаспределениеПлатежей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>РаспределениеПлатежей</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеВБанк</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Финансовый</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыСКонтрагентами</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлатежныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВБанк</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаРаспределяемыхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаОстаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРаспределяемая</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСКонтрагентами</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АвансПоСделке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДокументДт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.КорректировкаЗаписейРегистровНакопления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзБанка</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.Операция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Финансовый</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СделкаСПоставщиком</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходИзБанка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеВБанк</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаУслугиМатериалы</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.СвязьДокументовВРасчетахСКонтрагентами</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/РаспределениеПлатежей/Ext/ManagerModule.bsl
//+++АК LAGP 2018.06.27 ИП-00018465.04 Создание объекта. 
//Документ предназначен для "гашения" регистра накопления "Расчёты с контрагентами" по измерению "Сделка" со значениями документов ВозвратОтПокупателя, ПоступлениеВБанк, РеализацияТоваровИУслуг. 

Функция ПолучитьОстатокПлатёжногоДокумента(Документ, ДатаОстатка, РаспределениеПлатежей) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыСКонтрагентамиОстатки.Сделка,
		|	РасчетыСКонтрагентамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыСКонтрагентами.Остатки(&ДатаОстатка, Сделка = &Сделка) КАК РасчетыСКонтрагентамиОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатка", ДатаОстатка.Значение.Дата + 3);
	Запрос.УстановитьПараметр("Сделка", Документ);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СуммаДвиженийТекущегоДокументаВРегистре = 0;
	Если РаспределениеПлатежей.Проведен Тогда
		ЗапросСуммыДвиженийТекущегоДокумента = Новый Запрос;
		ЗапросСуммыДвиженийТекущегоДокумента.Текст = 
			"ВЫБРАТЬ
			|	РасчетыСКонтрагентамиОбороты.СуммаОборот
			|ИЗ
			|	РегистрНакопления.РасчетыСКонтрагентами.Обороты(&НачалоПериода, &КонецПериода, Регистратор, Сделка = &Сделка) КАК РасчетыСКонтрагентамиОбороты
			|ГДЕ
			|	РасчетыСКонтрагентамиОбороты.Регистратор = &Регистратор";
		
		ЗапросСуммыДвиженийТекущегоДокумента.УстановитьПараметр("НачалоПериода", ДатаОстатка.Значение.Дата - 3);
		ЗапросСуммыДвиженийТекущегоДокумента.УстановитьПараметр("КонецПериода", ДатаОстатка.Значение.Дата);
		ЗапросСуммыДвиженийТекущегоДокумента.УстановитьПараметр("Сделка", Документ);
		ЗапросСуммыДвиженийТекущегоДокумента.УстановитьПараметр("Регистратор", РаспределениеПлатежей);
		
		РезультатЗапросаСуммыДвиженийТекущегоДокумента = ЗапросСуммыДвиженийТекущегоДокумента.Выполнить();
		Если НЕ РезультатЗапросаСуммыДвиженийТекущегоДокумента.Пустой() Тогда
			ВыборкаДетальныеЗаписиДвиженийТекущего = РезультатЗапросаСуммыДвиженийТекущегоДокумента.Выбрать();
			ВыборкаДетальныеЗаписиДвиженийТекущего.Следующий();
			СуммаДвиженийТекущегоДокументаВРегистре = ВыборкаДетальныеЗаписиДвиженийТекущего.СуммаОборот;	
		КонецЕсли;	
	КонецЕсли;	
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СуммаДвиженийТекущегоДокументаВРегистре;
	Иначе
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат -ВыборкаДетальныеЗаписи.СуммаОстаток - СуммаДвиженийТекущегоДокументаВРегистре;
	КонецЕсли;	
		
КонецФункции
